Тестовая_база_ERP_14/src/Catalogs/ПравилаЛимитовПоДаннымБюджетирования/ПравилаЛимитовПоДаннымБюджетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЛимитовПоДаннымБюджетирования</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.МоделиБюджетирования</owners>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛимита</name>
    <type>
      <types>EnumRef.ТипыЛимитовРасходованияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияАналитикПерезаписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияАналитик</name>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/ПравилаЛимитовПоДаннымБюджетирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЭтоГруппа Тогда
		Если НЕ ИерархияАналитикПерезаписана Тогда
			ТабличнаяЧасть = ИерархияАналитик.Выгрузить();
			ТабличнаяЧасть.ЗаполнитьЗначения(Истина, "Используется"); 
			НоваяИерархия = Справочники.ПравилаЛимитовПоДаннымБюджетирования.ИерархияАналитик(
				Владелец,
				СтатьяБюджета,
				ТабличнаяЧасть);
			ИерархияАналитик.Загрузить(НоваяИерархия);
			ИерархияАналитикПерезаписана = Истина;
		КонецЕсли;
		ПредставлениеАналитик = Справочники.ПравилаЛимитовПоДаннымБюджетирования.ПредставлениеАналитик(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
